; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	spectrograph0 - mode
	thermograph4 - mode
	spectrograph3 - mode
	thermograph1 - mode
	thermograph2 - mode
	Star2 - direction
	Star3 - direction
	Star1 - direction
	GroundStation0 - direction
	Star4 - direction
	Star5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Planet17 - direction
	Planet18 - direction
	Planet19 - direction
	Star20 - direction
	Planet21 - direction
	Phenomenon22 - direction
	Planet23 - direction
	Planet24 - direction
	Planet25 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 Star1)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument2 thermograph2)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star2)
	(supports instrument3 spectrograph3)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet17)
	(supports instrument4 thermograph4)
	(supports instrument4 spectrograph3)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star1)
	(supports instrument5 thermograph4)
	(calibration_target instrument5 Star2)
	(supports instrument6 thermograph4)
	(calibration_target instrument6 Star2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon15)
	(supports instrument7 thermograph2)
	(calibration_target instrument7 Star1)
	(supports instrument8 thermograph4)
	(supports instrument8 thermograph2)
	(calibration_target instrument8 GroundStation0)
	(supports instrument9 thermograph4)
	(calibration_target instrument9 Star3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star5)
	(supports instrument10 thermograph1)
	(supports instrument10 thermograph4)
	(calibration_target instrument10 Star3)
	(supports instrument11 thermograph1)
	(supports instrument11 thermograph2)
	(calibration_target instrument11 Star1)
	(supports instrument12 thermograph2)
	(supports instrument12 thermograph1)
	(supports instrument12 spectrograph3)
	(calibration_target instrument12 GroundStation0)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet19)
)
(:goal (and
	(pointing satellite1 Star20)
	(pointing satellite2 Planet16)
	(have_image Star5 thermograph4)
	(have_image Planet6 thermograph4)
	(have_image Planet8 spectrograph0)
	(have_image Phenomenon9 thermograph1)
	(have_image Phenomenon10 thermograph1)
	(have_image Planet11 spectrograph0)
	(have_image Phenomenon12 spectrograph3)
	(have_image Star13 thermograph1)
	(have_image Planet14 thermograph4)
	(have_image Phenomenon15 thermograph4)
	(have_image Planet16 thermograph4)
	(have_image Planet17 thermograph4)
	(have_image Planet18 thermograph4)
	(have_image Planet19 spectrograph3)
	(have_image Star20 thermograph1)
	(have_image Planet21 thermograph2)
	(have_image Phenomenon22 thermograph4)
	(have_image Planet23 thermograph1)
	(have_image Planet25 spectrograph3)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 21
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 21
3. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 21
4. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 0 of 21
5. (turn_to satellite4 phenomenon10 planet19)
   deleted: (pointing satellite4 planet19)
   added: (pointing satellite4 phenomenon10)
   goals met: 0 of 21
6. (turn_to satellite4 star3 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 star3)
   goals met: 0 of 21
7. (calibrate satellite4 instrument10 star3)
   added: (calibrated instrument10)
   goals met: 0 of 21
8. (turn_to satellite4 phenomenon10 star3)
   deleted: (pointing satellite4 star3)
   added: (pointing satellite4 phenomenon10)
   goals met: 0 of 21
9. (take_image satellite4 phenomenon10 instrument10 thermograph1)
   added: (have_image phenomenon10 thermograph1)
   goals met: 1 of 21
10. (turn_to satellite4 phenomenon15 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 phenomenon15)
   goals met: 1 of 21
11. (take_image satellite4 phenomenon15 instrument10 thermograph4)
   added: (have_image phenomenon15 thermograph4)
   goals met: 2 of 21
12. (turn_to satellite4 phenomenon22 phenomenon15)
   deleted: (pointing satellite4 phenomenon15)
   added: (pointing satellite4 phenomenon22)
   goals met: 2 of 21
13. (take_image satellite4 phenomenon22 instrument10 thermograph4)
   added: (have_image phenomenon22 thermograph4)
   goals met: 3 of 21
14. (turn_to satellite4 phenomenon9 phenomenon22)
   deleted: (pointing satellite4 phenomenon22)
   added: (pointing satellite4 phenomenon9)
   goals met: 3 of 21
15. (take_image satellite4 phenomenon9 instrument10 thermograph1)
   added: (have_image phenomenon9 thermograph1)
   goals met: 4 of 21
16. (turn_to satellite4 planet14 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 planet14)
   goals met: 4 of 21
17. (take_image satellite4 planet14 instrument10 thermograph4)
   added: (have_image planet14 thermograph4)
   goals met: 5 of 21
18. (turn_to satellite4 planet16 planet14)
   deleted: (pointing satellite4 planet14)
   added: (pointing satellite4 planet16)
   goals met: 5 of 21
19. (take_image satellite4 planet16 instrument10 thermograph4)
   added: (have_image planet16 thermograph4)
   goals met: 6 of 21
20. (turn_to satellite4 planet17 planet16)
   deleted: (pointing satellite4 planet16)
   added: (pointing satellite4 planet17)
   goals met: 6 of 21
21. (take_image satellite4 planet17 instrument10 thermograph4)
   added: (have_image planet17 thermograph4)
   goals met: 7 of 21
22. (turn_to satellite4 planet18 planet17)
   deleted: (pointing satellite4 planet17)
   added: (pointing satellite4 planet18)
   goals met: 7 of 21
23. (take_image satellite4 planet18 instrument10 thermograph4)
   added: (have_image planet18 thermograph4)
   goals met: 8 of 21
24. (turn_to satellite4 planet23 planet18)
   deleted: (pointing satellite4 planet18)
   added: (pointing satellite4 planet23)
   goals met: 8 of 21
25. (take_image satellite4 planet23 instrument10 thermograph1)
   added: (have_image planet23 thermograph1)
   goals met: 9 of 21
26. (turn_to satellite4 planet6 planet23)
   deleted: (pointing satellite4 planet23)
   added: (pointing satellite4 planet6)
   goals met: 9 of 21
27. (take_image satellite4 planet6 instrument10 thermograph4)
   added: (have_image planet6 thermograph4)
   goals met: 10 of 21
28. (turn_to satellite4 star13 planet6)
   deleted: (pointing satellite4 planet6)
   added: (pointing satellite4 star13)
   goals met: 10 of 21
29. (take_image satellite4 star13 instrument10 thermograph1)
   added: (have_image star13 thermograph1)
   goals met: 11 of 21
30. (turn_to satellite4 star20 star13)
   deleted: (pointing satellite4 star13)
   added: (pointing satellite4 star20)
   goals met: 11 of 21
31. (take_image satellite4 star20 instrument10 thermograph1)
   added: (have_image star20 thermograph1)
   goals met: 12 of 21
32. (turn_to satellite4 star5 star20)
   deleted: (pointing satellite4 star20)
   added: (pointing satellite4 star5)
   goals met: 12 of 21
33. (take_image satellite4 star5 instrument10 thermograph4)
   added: (have_image star5 thermograph4)
   goals met: 13 of 21
34. (turn_to satellite2 planet16 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 planet16)
   goals met: 14 of 21
35. (turn_to satellite1 planet11 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 planet11)
   goals met: 14 of 21
36. (turn_to satellite1 star2 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 star2)
   goals met: 14 of 21
37. (calibrate satellite1 instrument2 star2)
   added: (calibrated instrument2)
   goals met: 14 of 21
38. (turn_to satellite1 planet11 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet11)
   goals met: 14 of 21
39. (take_image satellite1 planet11 instrument2 spectrograph0)
   added: (have_image planet11 spectrograph0)
   goals met: 15 of 21
40. (turn_to satellite1 planet21 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet21)
   goals met: 15 of 21
41. (take_image satellite1 planet21 instrument2 thermograph2)
   added: (have_image planet21 thermograph2)
   goals met: 16 of 21
42. (turn_to satellite1 planet8 planet21)
   deleted: (pointing satellite1 planet21)
   added: (pointing satellite1 planet8)
   goals met: 16 of 21
43. (take_image satellite1 planet8 instrument2 spectrograph0)
   added: (have_image planet8 spectrograph0)
   goals met: 17 of 21
44. (turn_to satellite1 star20 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star20)
   goals met: 18 of 21
45. (turn_to satellite0 phenomenon12 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon12)
   goals met: 18 of 21
46. (take_image satellite0 phenomenon12 instrument1 spectrograph3)
   added: (have_image phenomenon12 spectrograph3)
   goals met: 19 of 21
47. (turn_to satellite0 planet19 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet19)
   goals met: 19 of 21
48. (take_image satellite0 planet19 instrument1 spectrograph3)
   added: (have_image planet19 spectrograph3)
   goals met: 20 of 21
49. (turn_to satellite0 planet25 planet19)
   deleted: (pointing satellite0 planet19)
   added: (pointing satellite0 planet25)
   goals met: 20 of 21
50. (take_image satellite0 planet25 instrument1 spectrograph3)
   added: (have_image planet25 spectrograph3)
   goals met: 21 of 21
